{"references": [{"fullname_first_author": "James Thorne", "paper_title": "FEVER: a Large-scale Dataset for Fact Extraction and VERification", "publication_date": "2018-06-01", "reason": "This paper introduces the FEVER dataset, a benchmark used for evaluating the fact-checking performance of the proposed LOTUS system, which is central to the paper's evaluation methodology."}, {"fullname_first_author": "I.-Chun Chern", "paper_title": "FacTool: Factuality Detection in Generative AI - A Tool Augmented Framework for Multi-Task and Multi-Domain Scenarios", "publication_date": "2023-07-20", "reason": "This paper presents FacTool, a state-of-the-art fact-checking system used as a baseline for comparing the performance and efficiency of the proposed LOTUS system in the fact-checking task."}, {"fullname_first_author": "Karel D'Oosterlinck", "paper_title": "BioDEX: Large-Scale Biomedical Adverse Drug Event Extraction for Real-World Pharmacovigilance", "publication_date": "2023-05-18", "reason": "This paper introduces the Biodex dataset, which is used for evaluating the extreme multi-label classification performance of the proposed LOTUS system, demonstrating the system's capability in a complex real-world application."}, {"fullname_first_author": "Nandan Thakur", "paper_title": "BEIR: A Heterogenous Benchmark for Zero-shot Evaluation of Information Retrieval Models", "publication_date": "2021-04-26", "reason": "This paper introduces the BEIR benchmark, which provides datasets and evaluation metrics for information retrieval. It serves as a key benchmark for evaluating LOTUS's performance on the search and ranking tasks."}, {"fullname_first_author": "Omar Khattab", "paper_title": "DSPy: Compiling Declarative Language Model Calls into Self-Improving Pipelines", "publication_date": "2023-10-06", "reason": "This paper introduces DSPy, a system for compiling declarative language model calls into efficient pipelines. It is used as a comparison point for discussing the advantages of LOTUS's declarative programming model for semantic analytics."}]}